etc/OpenFOAM_Sample_Files/internalFlowExample/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    mesh_min_max
    {
        type            fixedValue;
        value           uniform 300;
    }

    building_model
    {
        type            fixedValue;
        value           uniform 300;
    }
    building_West_window
    {
        type            fixedValue;
        value           uniform 250;
    }
    building_East_window
    {
        type            turbulentHeatFluxTemperature;
        heatSource      flux;
        alphaEff        alphaEff;
        q               uniform 300;
    }
}

// ************************************************************************* //
